[
    {
        "role": "Owner and Author",
        "company": "DataScienceandEngineering.com",
        "company_url": "https://datascienceandengineering.com/",
        "summary": "\n- Developed a blogging website using Wordpress which documents projects as a series of blogs similar to chapters of a book. Users can follow along with a project to learn about and implement it.",
        "range": "April 2021 - Present"
    },
    {
        "role": "Freelancer and Blogger",
        "company": "Self-Employed",
        "company_url": "",
        "summary": "\n- Developed a search engine to import and index data from the O*NET database to build the backend of a job portal for job seekers. Used Elasticsearch as the engine to search about 100k rows with about 150 features. Used FastAPI for async indexing and Jinja2 as a template engine.\n- Developed a system to create question and answer from english corpuses uploaded by the user using a HuggingFace transformer and load the question-answer pair to a backend RDS database.",
        "range": "April 2021 - Present"
    },
    {
        "role": "AI Developer",
        "company": "Areli Commerce Private Limited",
        "company_url": "https://frendy.in/",
        "summary": "\n- Responsible for developing and maintaining a search system using AWS Elasticsearch, handling around 200k queries a month.\n- Developed a novel relevance sort algorithm to sort products using custom metrics as required by the business. This was adopted as the default sorting approach of displaying products across the e-commerce site, decreasing the customer attrition.\n- Developed a serverless recommender system using the k nearest neighbours algorithm using Flask, AWS Fargate and RDS. Worked alongside the mobile developers to insert event triggers to monitor the health of the application and provide analytics.",
        "range": "April 2019 - April 2021"
    },
    {
        "role": "AI Developer",
        "company": "Turabit Solutions Private Limited",
        "company_url": "https://turabit.com/",
        "summary": "\n- Worked on development of chatbots and developed API to make the chatbot install software applications on target machine as well as schedule the chatbot to perform a certain function at a time selected by the user.\n- Trained ML Models to perform text classification and determine the intent of the user query and trigger the necessary functions required to complete the requested task",
        "range": "June 2018 - March 2019"
    },
    {
        "role": "Data Science Intern",
        "company": "SoftVan Inc.",
        "company_url": "https://softvan.in/",
        "summary": "\n- Trained ML models for Insurance Fraud Detection, Loan Default Detection, Unsupervised Clustering as well as Object Detection using various architectures such as ResNet, AlexNet, and YOLO.",
        "range": "December 2017 - May 2018"
    }
]